Examinator/src/Enums/ВариантыКалендаряВебКабинетаСУО/ВариантыКалендаряВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыКалендаряВебКабинетаСУО</name>
  <enumValues>
    <name>Авто</name>
  </enumValues>
  <enumValues>
    <name>Классический</name>
  </enumValues>
  <enumValues>
    <name>Компактный</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ВариантыКалендаряВебКабинетаСУО/ManagerModule.bsl
Функция ПереводВарианта(Вариант) Экспорт
	
	Если Вариант = Перечисления.ВариантыКалендаряВебКабинетаСУО.Авто Тогда
		Возврат "auto";
	КонецЕсли;
	
	Если Вариант = Перечисления.ВариантыКалендаряВебКабинетаСУО.Классический Тогда
		Возврат "classic";
	КонецЕсли;
	
	Если Вариант = Перечисления.ВариантыКалендаряВебКабинетаСУО.Компактный Тогда
		Возврат "compact";
	КонецЕсли;
	
	Возврат "auto";
	
КонецФункции
